attacker/data/filtering/spoofing/ab_results/ab_62.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.100.1 (be patient).....done


Server Software:        uvicorn
Server Hostname:        192.168.100.1
Server Port:            5000

Document Path:          /matmul
Document Length:        21 bytes

Concurrency Level:      10
Time taken for tests:   78.217 seconds
Complete requests:      20
Failed requests:        16
   (Connect: 0, Receive: 0, Length: 16, Exceptions: 0)
Non-2xx responses:      4
Keep-Alive requests:    16
Total transferred:      3720 bytes
HTML transferred:       1224 bytes
Requests per second:    0.26 [#/sec] (mean)
Time per request:       39108.666 [ms] (mean)
Time per request:       3910.867 [ms] (mean, across all concurrent requests)
Transfer rate:          0.05 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   1.8      3       6
Processing:     8 14288 16801.1  13845   64937
Waiting:        0 14268 16818.2  13845   64937
Total:          8 14290 16801.2  13848   64937

Percentage of the requests served within a certain time (ms)
  50%  13848
  66%  15144
  75%  25155
  80%  26077
  90%  39367
  95%  64937
  98%  64937
  99%  64937
 100%  64937 (longest request)
