attacker/data/filtering/spoofing/ab_results/ab_83.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.100.1 (be patient).....done


Server Software:        uvicorn
Server Hostname:        192.168.100.1
Server Port:            5000

Document Path:          /matmul
Document Length:        21 bytes

Concurrency Level:      10
Time taken for tests:   6.141 seconds
Complete requests:      20
Failed requests:        6
   (Connect: 0, Receive: 0, Length: 6, Exceptions: 0)
Non-2xx responses:      14
Keep-Alive requests:    14
Total transferred:      2772 bytes
HTML transferred:       294 bytes
Requests per second:    3.26 [#/sec] (mean)
Time per request:       3070.638 [ms] (mean)
Time per request:       307.064 [ms] (mean, across all concurrent requests)
Transfer rate:          0.44 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   1.8      2       4
Processing:    14  497 1181.4    211    5470
Waiting:        0  451 1196.8    162    5470
Total:         14  500 1181.5    211    5472

Percentage of the requests served within a certain time (ms)
  50%    211
  66%    255
  75%    438
  80%    500
  90%    560
  95%   5472
  98%   5472
  99%   5472
 100%   5472 (longest request)
