attacker/data/filtering/spoofing/ab_results/ab_86.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.100.1 (be patient).....done


Server Software:        uvicorn
Server Hostname:        192.168.100.1
Server Port:            5000

Document Path:          /matmul
Document Length:        95 bytes

Concurrency Level:      10
Time taken for tests:   80.049 seconds
Complete requests:      20
Failed requests:        4
   (Connect: 0, Receive: 0, Length: 4, Exceptions: 0)
Non-2xx responses:      3
Keep-Alive requests:    19
Total transferred:      4498 bytes
HTML transferred:       1583 bytes
Requests per second:    0.25 [#/sec] (mean)
Time per request:       40024.311 [ms] (mean)
Time per request:       4002.431 [ms] (mean, across all concurrent requests)
Transfer rate:          0.05 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   15  32.7     16     149
Processing:    91 26763 25966.0  41213   58483
Waiting:        0 26755 25974.5  41213   58483
Total:         91 26779 25980.0  41213   58500

Percentage of the requests served within a certain time (ms)
  50%  41213
  66%  42349
  75%  57445
  80%  57752
  90%  58159
  95%  58500
  98%  58500
  99%  58500
 100%  58500 (longest request)
